Revit 2024 API
IFCGuidKey Class
 IFCGuidKey is used for case-sensitive comparison of GUID values for maps and sets.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class IFCGuidKey : IDisposable
Visual Basic
Public Class IFCGuidKey _
	Implements IDisposable
Visual C++
public ref class IFCGuidKey : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCGuidKey
See Also
IFCGuidKey Members
Autodesk.Revit.DB.IFC Namespace